# 7.2 Data Transformation

In [1]:
import numpy as np
import pandas as pd

---

## Removing Duplicates

In [2]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [3]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The DataFrame method duplicated returns a boolean Series indicating whether each
row is a duplicate (has been observed in a previous row) or not:

In [4]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [6]:
data.drop_duplicates() # remove the duplicate values

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [7]:
data['v1'] = range(7)

In [8]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [10]:
data.drop_duplicates(['k1']) 
# remove duplicates in column k1 and propagates it
# by default, keep the first observed value combination

    k1  k2  v1
0  one   1   0
1  two   1   1

In [11]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

___

## Transforming Data Using a Function or Mapping

In [12]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                     'Pastrami', 'corned beef', 'Bacon',
                     'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [13]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Suppose we wanted to add a column indicating the type of animal that each food came from.

In [14]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [15]:
# convert to lower case
lowercased = data['food'].str.lower()

In [16]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [17]:
data['animal'] = lowercased.map(meat_to_animal)
# map takes dict containing key(things to map)-value(map value)

In [18]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [19]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Using map is a convenient way to perform element-wise transformations and other
data cleaningâ€“related operations.

In [21]:
data['ounces'].map(lambda x: '%.2f' % x)

0     4.00
1     3.00
2    12.00
3     6.00
4     7.50
5     8.00
6     3.00
7     5.00
8     6.00
Name: ounces, dtype: object

In [22]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

---

## Replacing Values

In [23]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [24]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [25]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [26]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [27]:
data.replace((-999, 1000), (np.nan, 0))
# not good

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [28]:
data.replace({-999 : np.nan, -1000 : 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

---

## Renaming Axis Indexes

In [29]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [30]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [31]:
data.index.map(lambda x: x.upper())

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [34]:
data.reindex(index=data.index.map(lambda x: x[:4].upper()))

      one  two  three  four
OHIO  NaN  NaN    NaN   NaN
COLO  NaN  NaN    NaN   NaN
NEW   NaN  NaN    NaN   NaN

In [36]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [38]:
data.rename(index={'Ohio' : 'Indiana'},
            columns={'three' : 'peekaboo'})

          one  two  peekaboo  four
Indiana     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

rename saves you from the chore of copying the DataFrame manually and assigning
to its index and columns attributes.

---

## Discretization and Binning

In [39]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [40]:
bins = [18, 25, 35, 60, 100]

In [41]:
cats = pd.cut(ages, bins)

In [42]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [43]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [44]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [45]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [46]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [47]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [48]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [49]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [50]:
data = np.random.rand(20)

In [51]:
pd.cut(data, 4, precision=2)
# precision specifies the floatint point accuracy

[(0.061, 0.27], (0.68, 0.89], (0.27, 0.47], (0.061, 0.27], (0.27, 0.47], ..., (0.061, 0.27], (0.27, 0.47], (0.061, 0.27], (0.061, 0.27], (0.061, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.061, 0.27] < (0.27, 0.47] < (0.47, 0.68] < (0.68, 0.89]]

In [52]:
data = np.random.randn(1000)
# normally distributed

In [53]:
cats = pd.qcut(data, 4)
# cut into quartiles

In [54]:
cats

[(-0.642, 0.0843], (-0.642, 0.0843], (0.7, 3.315], (0.7, 3.315], (-3.568, -0.642], ..., (0.7, 3.315], (0.7, 3.315], (-0.642, 0.0843], (-3.568, -0.642], (0.0843, 0.7]]
Length: 1000
Categories (4, interval[float64]): [(-3.568, -0.642] < (-0.642, 0.0843] < (0.0843, 0.7] < (0.7, 3.315]]

In [55]:
cats.value_counts()

(-3.568, -0.642]    250
(-0.642, 0.0843]    250
(0.0843, 0.7]       250
(0.7, 3.315]        250
dtype: int64

In [56]:
pd.qcut(data, [0, 0.1, 0.9, 1.])
# specifying our own quartiles

[(-1.272, 1.255], (-1.272, 1.255], (-1.272, 1.255], (1.255, 3.315], (-1.272, 1.255], ..., (1.255, 3.315], (1.255, 3.315], (-1.272, 1.255], (-1.272, 1.255], (-1.272, 1.255]]
Length: 1000
Categories (3, interval[float64]): [(-3.568, -1.272] < (-1.272, 1.255] < (1.255, 3.315]]

---

## Detecting and Filtering Outliers

In [57]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [58]:
data.shape

(1000, 4)

In [59]:
data.head()

          0         1         2         3
0  0.534160 -0.579230 -1.504207  0.068672
1  0.642070 -1.172970  0.651227 -0.766144
2 -0.015686 -0.475680  0.691779  0.817825
3 -1.113621  1.032874  0.892327  1.822822
4 -1.326448 -0.122973 -0.131631 -0.826176

In [60]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.036369     0.006427    -0.013877    -0.036156
std       1.020693     1.007309     0.993053     0.961976
min      -3.612113    -3.131778    -3.609922    -3.060451
25%      -0.679119    -0.658186    -0.666302    -0.693199
50%       0.054048    -0.003231    -0.035623    -0.053621
75%       0.715131     0.667325     0.679877     0.614650
max       3.390502     3.424243     3.011786     2.718913

In [61]:
col = data[2]

In [63]:
col.shape

(1000,)

In [64]:
col[np.abs(col) > 3]

279    3.011786
946   -3.609922
Name: 2, dtype: float64

In [68]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
14   0.398433 -0.541545  1.271162 -3.053818
228  3.390502 -0.859490  1.312244 -1.048666
279  0.127135  0.271714  3.011786 -0.117184
328  0.137116  3.276462  0.513356 -0.002484
348 -3.612113  2.581731  2.182906  1.840348
435 -3.042899  0.746293 -0.368963  0.765108
514 -1.268449 -1.302762  0.422989 -3.060451
595  1.761151  3.424243 -0.707000 -0.218350
744  3.078321  0.518683 -0.269435  2.151830
755  3.032404  1.474044  0.523078  0.943684
863 -1.416952 -3.131778  0.515557  0.334045
946  1.836534  0.282778 -3.609922 -0.877008

In [72]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
14   0.398433 -0.541545  1.271162 -3.053818
228  3.390502 -0.859490  1.312244 -1.048666
279  0.127135  0.271714  3.011786 -0.117184
328  0.137116  3.276462  0.513356 -0.002484
348 -3.612113  2.581731  2.182906  1.840348
435 -3.042899  0.746293 -0.368963  0.765108
514 -1.268449 -1.302762  0.422989 -3.060451
595  1.761151  3.424243 -0.707000 -0.218350
744  3.078321  0.518683 -0.269435  2.151830
755  3.032404  1.474044  0.523078  0.943684
863 -1.416952 -3.131778  0.515557  0.334045
946  1.836534  0.282778 -3.609922 -0.877008

In [74]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [76]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.036522     0.005859    -0.013279    -0.036042
std       1.017016     1.004691     0.990991     0.961620
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.679119    -0.658186    -0.666302    -0.693199
50%       0.054048    -0.003231    -0.035623    -0.053621
75%       0.715131     0.667325     0.679877     0.614650
max       3.000000     3.000000     3.000000     2.718913

---

## Permutation and Random Sampling

In [79]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [80]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [81]:
sampler = np.random.permutation(5)

In [83]:
sampler

array([0, 2, 4, 1, 3])

In [84]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [85]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15

To select a random subset without replacement, you can use the sample method on
Series and DataFrame:

In [86]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [88]:
df.sample(n=3, replace=True)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
0   0   1   2   3

---

## Computing Indicator/Dummy Variables

Converting a categorical variable into a 'dummy' or 'indicator' matrix.

In [89]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [90]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [91]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [92]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [93]:
df_with_dummy = df[['data1']].join(dummies)

In [94]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0